## Production: efs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_efs_mount_target.efs_mount[0] must be replaced
-/+ resource "aws_efs_mount_target" "efs_mount" {
      ~ availability_zone_id   = "cac1-az1" -> (known after apply)
      ~ availability_zone_name = "ca-central-1a" -> (known after apply)
      ~ dns_name               = "fs-0ee57b8f2b2e8fe38.efs.ca-central-1.amazonaws.com" -> (known after apply)
      ~ file_system_arn        = "arn:aws:elasticfilesystem:ca-central-1:414662622316:file-system/fs-0ee57b8f2b2e8fe38" -> (known after apply)
      ~ id                     = "fsmt-063b261553c7fe192" -> (known after apply)
      ~ ip_address             = "10.0.3.166" -> (known after apply)
      ~ mount_target_dns_name  = "ca-central-1a.fs-0ee57b8f2b2e8fe38.efs.ca-central-1.amazonaws.com" -> (known after apply)
      ~ network_interface_id   = "eni-03c95da0d5a4156cb" -> (known after apply)
      ~ owner_id               = "414662622316" -> (known after apply)
      ~ subnet_id              = "subnet-066c6b13009cc761a" -> "subnet-0eb6100fb7b928309" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_efs_mount_target.efs_mount[1] must be replaced
-/+ resource "aws_efs_mount_target" "efs_mount" {
      ~ availability_zone_id   = "cac1-az2" -> (known after apply)
      ~ availability_zone_name = "ca-central-1b" -> (known after apply)
      ~ dns_name               = "fs-0ee57b8f2b2e8fe38.efs.ca-central-1.amazonaws.com" -> (known after apply)
      ~ file_system_arn        = "arn:aws:elasticfilesystem:ca-central-1:414662622316:file-system/fs-0ee57b8f2b2e8fe38" -> (known after apply)
      ~ id                     = "fsmt-05e315ca19321a7d8" -> (known after apply)
      ~ ip_address             = "10.0.4.27" -> (known after apply)
      ~ mount_target_dns_name  = "ca-central-1b.fs-0ee57b8f2b2e8fe38.efs.ca-central-1.amazonaws.com" -> (known after apply)
      ~ network_interface_id   = "eni-0d138a8098c154e28" -> (known after apply)
      ~ owner_id               = "414662622316" -> (known after apply)
      ~ subnet_id              = "subnet-0f0e20195a44b2a73" -> "subnet-0ff73a0b898dee7d3" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_efs_mount_target.efs_mount[2] must be replaced
-/+ resource "aws_efs_mount_target" "efs_mount" {
      ~ availability_zone_id   = "cac1-az4" -> (known after apply)
      ~ availability_zone_name = "ca-central-1d" -> (known after apply)
      ~ dns_name               = "fs-0ee57b8f2b2e8fe38.efs.ca-central-1.amazonaws.com" -> (known after apply)
      ~ file_system_arn        = "arn:aws:elasticfilesystem:ca-central-1:414662622316:file-system/fs-0ee57b8f2b2e8fe38" -> (known after apply)
      ~ id                     = "fsmt-08955648569fc5606" -> (known after apply)
      ~ ip_address             = "10.0.5.220" -> (known after apply)
      ~ mount_target_dns_name  = "ca-central-1d.fs-0ee57b8f2b2e8fe38.efs.ca-central-1.amazonaws.com" -> (known after apply)
      ~ network_interface_id   = "eni-0d2b8f477e97f610b" -> (known after apply)
      ~ owner_id               = "414662622316" -> (known after apply)
      ~ subnet_id              = "subnet-04892391188217b74" -> "subnet-0bab694b39aeddc27" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_efs_access_point.efs_access_point"]
WARN - plan.json - main - Missing Common Tags: ["aws_efs_file_system.generated_statement_efs"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
